package JC_Conditional_statements_and_loops;

/**
 * Создать пустой проект в IntelliJ IDEA и прописать метод main()
 */
public class Task1 {
    public static void main(String[] args) {
        System.out.println("Hello");
    }
}
